/*******************************************************************
版权声明：    寒武纪
文件名：         stm32f10x_dac_config.h
创建日期:        2016.8.17
文件版本：    1.0
--------------------------------------------------------------------
模块描述：
函数列表：
                1、
                2、
                3、
                4、
--------------------------------------------------------------------
修改记录：
              序号     作者       时间         版本         说明
                 1 、  嵌入式组    2016.8.17       1.0       需要后续完善
                 2 、
                 3 、
                 4 、
********************************************************************/
#ifndef  __STM32F40x_DAC_CONFIG_H
#define  __STM32F40x_DAC_CONFIG_H


#ifdef __cplusplus
extern "C" {
#endif


/* Includes ------------------------------------------------------------------*/

	 #include "stm32f4xx_conf.h"




#ifdef __cplusplus
}
#endif/* extern "C" */

#endif


/******************* (C) COPYRIGHT 2016 HWJ *****END OF FILE****/

